; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	
    (is-package ?o)
	(is-truck ?t)
    (is-location ?l)
	(is-airplane ?a)
    (is-hub ?hub)
	(in ?o1 ?o2))

(:action load-truck
  :parameters
   (?o
    ?t
    ?l)
  :precondition
   (and (is-package ?o) (is-truck ?t) (is-location ?l)
   (in ?t ?l) (in ?o ?l))
  :effect
   (and (not (in ?o ?l)) (in ?o ?t)))

(:action load-airplane
  :parameters
   (?o
    ?a
    ?l)
  :precondition
   (and (is-package ?o) (is-airplane ?a) (is-location ?l)
   (in ?o ?l) (in ?a ?l))
  :effect
   (and (not (in ?o ?l)) (in ?o ?a)))

(:action unload-truck
  :parameters
   (?o
    ?t
    ?l)
  :precondition
   (and (is-package ?o) (is-truck ?t) (is-location ?l)
        (in ?t ?l) (in ?o ?t))
  :effect
   (and (not (in ?o ?t)) (in ?o ?l)))

(:action unload-airplane
  :parameters
   (?o
    ?a
    ?l)
  :precondition
   (and (is-package ?o) (is-airplane ?a) (is-location ?l)
        (in ?o ?a) (in ?a ?l))
  :effect
   (and (not (in ?o ?a)) (in ?o ?l)))

(:action move-truck
  :parameters
   (?t
    ?l-from
    ?l-to
    ?l)
  :precondition
   (and (is-truck ?t) (is-location ?l-from) (is-location ?l-to) (is-location ?l)
   (in ?t ?l-from)
   (in ?l-from ?l)
   (in ?l-to ?l))
  :effect
   (and (not (in ?t ?l-from)) (in ?t ?l-to)))

(:action move-airplane
  :parameters
   (?a
    ?l-from
    ?l-to)
  :precondition
   (and (is-airplane ?a) (is-hub ?l-from) (is-hub ?l-to)
	(in ?a ?l-from))
  :effect
   (and (not (in ?a ?l-from)) (in ?a ?l-to)))
)

; problem
(define (problem logistics-1)
(:domain logistics-strips)
(:objects airplane1 airplane2 location2 location3 location1 location4 city2 city1 truck2 truck1 package1 )
(:init (is-package package1)(is-truck truck1) (is-truck truck2) 
(is-location city1) (is-location city2) 
(is-location location1) (is-location location2) (is-location location3) (is-location location4) 
(is-hub location1)(is-hub location3) 
(is-airplane airplane1)(is-airplane airplane2) 
(in airplane1 location3) (in airplane2 location1) (in truck1 location4) (in truck2 location1) (in package1 location3)
(in location2 city1) (in location1 city1) (in location3 city2) (in location4 city2))
(:goal (and (in package1 location2)))
)

; plan
1. (load-airplane package1 airplane1 location3)
   deleted: (in package1 location3)
   added: (in package1 airplane1)
   goals met: 0 of 1
2. (move-airplane airplane1 location3 location1)
   deleted: (in airplane1 location3)
   added: (in airplane1 location1)
   goals met: 0 of 1
3. (unload-airplane package1 airplane1 location1)
   deleted: (in package1 airplane1)
   added: (in package1 location1)
   goals met: 0 of 1
4. (load-truck package1 truck2 location1)
   deleted: (in package1 location1)
   added: (in package1 truck2)
   goals met: 0 of 1
5. (move-truck truck2 location1 location2 city1)
   deleted: (in truck2 location1)
   added: (in truck2 location2)
   goals met: 0 of 1
6. (unload-truck package1 truck2 location2)
   deleted: (in package1 truck2)
   added: (in package1 location2)
   goals met: 1 of 1
